IdeaRS.OpenModel.Detail.EdgePositionType
Position of reinforcement on edge

IdeaRS.OpenModel.Detail.EdgePositionType.WholeLength
WholeLength

IdeaRS.OpenModel.Detail.EdgePositionType.PartEdgeFromBegin
Part edge from beginning

IdeaRS.OpenModel.Detail.EdgePositionType.PartEdgeFromEnd
Part edge from end

IdeaRS.OpenModel.Detail.EdgePositionType.PartEdgeToSegment
Part edge to the end